; domain
(define (domain hanoi)
	(:requirements :strips)
	(:types )
	(:constants )
	(:predicates
		(split )
		(unsplit )
		(g0_done___ )
		(g0_clear ?x)
		(g0_on ?x ?y)
		(g0_smaller ?x ?y)
	)
(:action do-split
	:parameters ()
	:precondition (and (unsplit ))
	:effect (and (not (unsplit )) (split ))
)
(:action mark-done-g0
	:parameters ()
	:precondition (and (split ) (g0_on d4 peg3) (g0_on d3 d4) (g0_on d2 d3) (g0_on d1 d2))
	:effect (and (g0_done___ ))
)
(:action gGLOBAL_move
	:parameters (?disc ?from ?to)
	:precondition (and (unsplit ) (g0_smaller ?to ?disc) (g0_on ?disc ?from) (g0_clear ?disc) (g0_clear ?to))
	:effect (and (g0_clear ?from) (g0_on ?disc ?to) (not (g0_on ?disc ?from)) (not (g0_clear ?to)) (increase (total-cost ) 1))
)
(:action g0_move
	:parameters (?disc ?from ?to)
	:precondition (and (g0_smaller ?to ?disc) (g0_on ?disc ?from) (g0_clear ?disc) (g0_clear ?to) (split ))
	:effect (and (g0_clear ?from) (g0_on ?disc ?to) (not (g0_on ?disc ?from)) (not (g0_clear ?to)))
)
)

; problem
(define (problem hanoi-4)
	(:domain hanoi)
	(:objects peg1 peg2 peg3 d1 d2 d3 d4)
	(:init 
		(unsplit )
		(g0_smaller peg1 d1)
		(g0_smaller peg1 d2)
		(g0_smaller peg1 d3)
		(g0_smaller peg1 d4)
		(g0_smaller peg2 d1)
		(g0_smaller peg2 d2)
		(g0_smaller peg2 d3)
		(g0_smaller peg2 d4)
		(g0_smaller peg3 d1)
		(g0_smaller peg3 d2)
		(g0_smaller peg3 d3)
		(g0_smaller peg3 d4)
		(g0_smaller d1 d1)
		(g0_smaller d2 d1)
		(g0_smaller d3 d1)
		(g0_smaller d4 d1)
		(g0_smaller d2 d2)
		(g0_smaller d3 d2)
		(g0_smaller d4 d2)
		(g0_smaller d3 d3)
		(g0_smaller d4 d3)
		(g0_clear peg2)
		(g0_clear peg3)
		(g0_clear d1)
		(g0_on d4 peg1)
		(g0_on d3 d4)
		(g0_on d2 d3)
		(g0_on d1 d2)
	)
	(:goal (and (g0_on d4 peg3) (g0_on d3 d4) (g0_on d2 d3) (g0_on d1 d2)))
)

; plan
1. (gglobal_move d1 d2 peg2)
   deleted: (g0_on d1 d2) (g0_clear peg2)
   added: (g0_clear d2) (g0_on d1 peg2)
   goals met: 2 of 4
2. (gglobal_move d2 d3 peg3)
   deleted: (g0_on d2 d3) (g0_clear peg3)
   added: (g0_clear d3) (g0_on d2 peg3)
   goals met: 1 of 4
3. (gglobal_move d1 peg2 d2)
   deleted: (g0_on d1 peg2) (g0_clear d2)
   added: (g0_clear peg2) (g0_on d1 d2)
   goals met: 2 of 4
4. (gglobal_move d3 d4 peg2)
   deleted: (g0_on d3 d4) (g0_clear peg2)
   added: (g0_clear d4) (g0_on d3 peg2)
   goals met: 1 of 4
5. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 0 of 4
6. (gglobal_move d2 peg3 d3)
   deleted: (g0_on d2 peg3) (g0_clear d3)
   added: (g0_clear peg3) (g0_on d2 d3)
   goals met: 1 of 4
7. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 2 of 4
8. (gglobal_move d4 peg1 peg3)
   deleted: (g0_on d4 peg1) (g0_clear peg3)
   added: (g0_clear peg1) (g0_on d4 peg3)
   goals met: 3 of 4
9. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 2 of 4
10. (gglobal_move d2 d3 peg1)
   deleted: (g0_on d2 d3) (g0_clear peg1)
   added: (g0_clear d3) (g0_on d2 peg1)
   goals met: 1 of 4
11. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 2 of 4
12. (gglobal_move d3 peg2 d4)
   deleted: (g0_on d3 peg2) (g0_clear d4)
   added: (g0_clear peg2) (g0_on d3 d4)
   goals met: 3 of 4
13. (gglobal_move d1 d2 peg2)
   deleted: (g0_on d1 d2) (g0_clear peg2)
   added: (g0_clear d2) (g0_on d1 peg2)
   goals met: 2 of 4
14. (gglobal_move d2 peg1 d3)
   deleted: (g0_on d2 peg1) (g0_clear d3)
   added: (g0_clear peg1) (g0_on d2 d3)
   goals met: 3 of 4
15. (gglobal_move d1 peg2 d2)
   deleted: (g0_on d1 peg2) (g0_clear d2)
   added: (g0_clear peg2) (g0_on d1 d2)
   goals met: 4 of 4
